Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
void appAdvStop(void)
{
    ret_code_t ret;
    NRF_LOG_INFO("ADV STOP:");
    switch(appState.connectState)
    {
    case CONNECTION_CONNECT:
        NRF_LOG_INFO("ADV STOP: already stoped");
        break;
    case CONNECTION_START_DISCONNECT:
        appState.isAppAdv = false;
        NRF_LOG_INFO("ADV STOP: disconnected process");
        break;
    case CONNECTION_DISCONNECT:
        appState.isAppAdv = false;
        if(!appState.isRealAdv)
        {
            NRF_LOG_INFO("ADV STOP: current stop");
            return;
        }
        appState.isRealAdv = false;
        ret = sd_ble_gap_adv_stop();
        NRF_LOG_INFO("ADV STOP: ret = %d", ret);
        APP_ERROR_CHECK(ret);
        NRF_LOG_INFO("ADV STOP: ok");
        break;
    default:
        break;
    }
    NRF_LOG_INFO("ADV STOP: ok");

}


void appAdvStart(void)
{
    ret_code_t ret;
    switch(appState.connectState)
    {
        case CONNECTION_CONNECT:
            // after disconnect nrf automatically start advertising
            appState.isAppAdv = true;
            NRF_LOG_INFO("ADV: disconnect connection");
            ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            NRF_LOG_INFO("ADV: ret = %d", ret);
            APP_ERROR_CHECK(ret);
            break;
        case CONNECTION_START_DISCONNECT:
            appState.isAppAdv = true;
            NRF_LOG_INFO("ADV: wait disconnect");
            break;
        case CONNECTION_DISCONNECT:
            if(appState.isRealAdv)
            {
                NRF_LOG_INFO("ADV: running state");
                break;
            }
            appState.isAppAdv  = true;
            appState.isRealAdv = true;
            NRF_LOG_INFO("ADV: start");
            ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
            NRF_LOG_INFO("ADV: ret = %d", ret);
            APP_ERROR_CHECK(ret);
            break;
        default: break;
    }
    NRF_LOG_INFO("ADV: ok");
}


static void advertising_init(uint16_t intervalMSeconds, uint16_t periodSeconds, bool whitelistEnabled)
{
    ret_code_t err_code;
    uint8_t    adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_on_disconnect_disabled = false;
    init.config.ble_adv_whitelist_enabled      = whitelistEnabled;
    init.config.ble_adv_directed_enabled       = false;
    init.config.ble_adv_directed_slow_enabled  = false;
    init.config.ble_adv_directed_slow_interval = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_directed_slow_timeout  = APP_ADV_FAST_TIMEOUT;
    init.config.ble_adv_fast_enabled           = true;
    init.config.ble_adv_fast_interval          = intervalMSeconds;
    init.config.ble_adv_fast_timeout           = periodSeconds;
    init.config.ble_adv_slow_enabled           = false;
    init.config.ble_adv_slow_interval          = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout           = APP_ADV_SLOW_TIMEOUT;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


bool appPeerGetIdInList(pm_peer_id_t peerIdIn)
{
    pm_peer_id_t peer_id;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    while (peer_id != PM_PEER_ID_INVALID )
    {
        if( peerIdIn == peer_id)
        {
            return true;
        }
        peer_id = pm_next_peer_id_get(peer_id);
    }
    return false;
}


static void appAdvSetStart(advTypeT advType, uint16_t peerId)
{
    ret_code_t ret;

    switch(advType)
    {
    case ADV_GENERAL: // advertising without white list
        NRF_LOG_INFO("ADV General");
        appState.currentAdvType = ADV_GENERAL;

        m_whitelist_peer_cnt = 0;
        ret = pm_whitelist_set(NULL, 0);
        APP_ERROR_CHECK(ret);
        ret = pm_device_identities_list_set(NULL, 0);
        if (ret != NRF_ERROR_NOT_SUPPORTED)
        {
            APP_ERROR_CHECK(ret);
        }

        if(m_conn_handle != BLE_CONN_HANDLE_INVALID) // host connected
        {
            NRF_LOG_INFO("----start adv DISCONNECT-----");
            appAdvStart();
        }
        else   // host not connect
        {
            NRF_LOG_INFO("----start adv ADV-----");
            appAdvStop();  // use this stop adv for activate white list with new devices
            appAdvStart();
            APP_ERROR_CHECK(ret);
        }
        return;
        break;

    case ADV_ADD_NEW: // advertising without white list, but REJECT connection all current peers
        NRF_LOG_INFO("ADV add new");
        appState.currentAdvType = ADV_ADD_NEW;

 /*      appAdvStop();  // use this stop adv for activate white list with new devices

        m_whitelist_peer_cnt = 0;
       ret = pm_whitelist_set(NULL, 0);
        APP_ERROR_CHECK(ret);
        ret = pm_device_identities_list_set(NULL, 0);
        if (ret != NRF_ERROR_NOT_SUPPORTED)
        {
            APP_ERROR_CHECK(ret);
        }


        if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            NRF_LOG_INFO("----start adv DISCONNECT-----");
            appAdvStart();
        }
        else
        {
            NRF_LOG_INFO("----start adv ADV-----");
            appAdvStop();  // use this stop adv for activate white list with new devices
            appAdvStart();
            APP_ERROR_CHECK(ret);
        }
        return;
        break;
*/
        m_whitelist_peer_cnt = 0;

        break;
    case ADV_RECONNECT_SCAN:

        memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
        m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));
        peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

        NRF_LOG_INFO("Adv recon: %d", m_whitelist_peer_cnt);


        if(m_whitelist_peer_cnt == 0) // if no peer devices -
        {
            appState.currentAdvType = ADV_GENERAL;
            //appAdvStop();  // use this stop adv for activate white list with new devices
            //appAdvStart();
            //return;
        }
        else
        {
            appState.currentAdvType = ADV_RECONNECT_SCAN;
            timerRun(stopScanAdvTimerCallback, ADV_RECONNECT_SCAN_TIMEOUT);
            scaningTimeout = getTime();
        }
        break;
    case ADV_RECONNECT_CONNECT:
        appState.currentAdvType = ADV_RECONNECT_SCAN;
        // set white list parameters
        NRF_LOG_INFO("Adv recon conn");
        m_whitelist_peers[0] = peerId;
        m_whitelist_peer_cnt = 1;
        break;
    default:
        break;
    }
    appAdvStop();  // use this stop adv for activate white list with new devices

    ret = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                           (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    ret = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                        (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    NRF_LOG_INFO("ret = %d", ret);

    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }

